{"pages":[{"title":"About ikarus-999","text":"Intro. HE11ow World!!안녕하세요 노래, 음악을 좋아하는개발자입니다 🕹공부하는게 즐거워서 개발을 시작하게 되었어요 💽I like studying 💻I Like Developing 🖥 Contacts 📫 EMAIL = next.forr@gmail.com","link":"/about/index.html"}],"posts":[{"title":"firstpost1","text":"HEXO 블로그 설치와 사용법새 글 쓰는 법1$ hexo new [레이아웃이름] &quot;새 포스트이름&quot; 레이아웃 디폴트(바로 발행) : post 바로 발행되지 않는 글 : draft 1$ hexo publish &quot;새 포스트이름&quot; 으로 draft에서 publish 합니다. publish는 잘 쓰지 않는다 파일명 에러나기 때문. 그냥냅다 MarkDown으로 쓰고 hexo g -d로 해버림","link":"/2020/10/24/firstpost1/"},{"title":"fpost2","text":"머신러닝과 딥러닝의 차이머신러닝 머신러닝은 정형 데이터 표 형태의 데이터 딥러닝은 비정형 데이터 그림, 사진, 오디오 형태의 자연 데이터 머신러닝 기초 준비물 충분한 용량(RAM 32GB++, SSD 512GB++, i7-10Gen++)의 데스크탑 권장! 가장 먼저 파이썬, 텐서플로우 를 설치합니다. 설치 버전 확인!! 매우 중요합니다! 파이썬 텐서플로우 넘파이 &amp; 싸이킷런 파이썬 버전을 여러개 설치 가능합니다. 이때는 환경 변수, IDE 경로 셋팅이 중요합니다. 윈도우라면 CMD보다는 powershell을 쓰는것이 편합니다. 제일 쉬운 방법은 아나콘다🛎… 하지만 용량이 큽니다. 써본 결과 리눅스에 도커가 최적 환경입니다⚙️. 추후 포스팅 예정 입니다.📯 Lets Burn the GPU!!🔥🔥🔥(TF2.0 wow!!)123456789101112131415161718192021import sysimport numpy as npimport tensorflow as tffrom datetime import datetime# tensorflow 실행모드를 확인합니다print(tf.executing_eagerly())shape = (int(10000), int(10000))startTime = datetime.now()with tf.device(&quot;/gpu&quot;): random_matrix = tf.random.uniform(shape=shape, minval=0, maxval=1) dot_operation = tf.matmul(random_matrix, tf.transpose(random_matrix)) sum_operation = tf.reduce_sum(dot_operation)result = sum_operationprint(result)print(&quot;\\n&quot; * 2)print(&quot;Time taken:&quot;, datetime.now() - startTime)print(&quot;\\n&quot; * 2)","link":"/2020/10/24/fpost2/"},{"title":"fpost3","text":"일상을 끄적이다 - Mel Spectrogram 자동 분석을 위한 test page 입니다.M2U - March Of Fear비탄으로 가득 찬 이 도시 안에 떨어지는 Melody, 감정을 연기하는 춤추는 Endless rain… 거짓말로 얼룩진 관계들 속에 웃을 수 있는 거야? 세계를 노래하는 The March of Fear. We live in the tragedy! 유명한 비극과 같은 잔혹한 세계 속에 우리는 웃음짓고 있어. 이 세계를 비웃는 고결한 수호자들에게 지켜낼 것들은 두려웠던 자신뿐이니까! 숨을 멈춘 사람들 속에서 청명하게 울려퍼지는 Aria… 병든 마음으로 가득찬 이 세계에 폭격을 날려! 지금 웃고 있는 너도 Sociopath, 알잖아? 우리는 이 곳에 생명이 깃든 포성을 던져! 에픽세븐 OST 「Promise」깊은 절망 속에 갇혀 쓰러져 가는 나의 두 손을가만히 잡아 준 따스한 너의 온기를 아직난 기억해Now I can hear you눈을 감으면손 끝에서 널 느껴Now I can hear youI can find you이젠 알 수 있어 약속해 Promise I promise 잊지 않을게우리 함께 나눈 약속들을Promise I promise 어둠을 지난N 번째 하늘 아래 이곳에끝이 보이지 않아도 때론 지쳐서 주저 앉아도약속해 희망을 우리 마음에 간절히 모아빛을 향해Now I can hear you눈을 감으면손 끝에서 널 느껴Now I can hear youI can find you이젠 알 수 있어약속해 Promise I promise 잊지 않을게우리 함께 나눈 약속들을Promise I promise 어둠을 지난N 번째 하늘 아래 이곳에 다시 시작된 시간 다시 걸어가는 길함께하기에 나는 빛날 수 있어멀리 조금씩 보여 따뜻한 파란 빛이우리 마음을 여기에 모아 시작해 한번 더 약속해 Promise I promise 잊지 않을게우리 함께 나눈 약속들을Promise I promise 어둠을 지난N 번째 하늘 아래 약속들을 Promise I promise 어둠을 지난N 번째 하늘 아래 이곳에 Mel Spectrogram 분석 중인 음악입니다. GPU와 스토리지 지원좀 부탁드립니다.","link":"/2020/10/26/fpost3/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/10/24/hello-world/"},{"title":"training_pc","text":"딥러닝 공부 후기 비정형 데이터를 다룰려면 GPU는 필수다. Why GPU ?? CPU보다 더 빠른 병렬 처리 가능 행렬곱 계산이 CPU보다 훨씬 빠름 계산 그래프 빌드, 처리 속도가 빠름. 비정형 데이터 처리엔 GPU가 필수 음성 딥러닝, 나도 해볼까?음성 딥러닝 음성 딥러닝은 결코 쉽지 않다. 딥러닝계의 보스급.신호처리 배워야 그나마 수월하다.초반 Feature Extraction 경험을 쌓는것을 권장한다.RNN계열의 LSTM으로 시작. 하지만,Attention, Transformer 날코딩 등 논문 구현 경험이 매우 중요하다.Mel Spectrogram을 한다 해도 원리를 잘 알아야 나중에 모델링과 데이터 분해가 쉽다. 딥러닝 입문 방법딥러닝 입문 하려면 수학은 필수. 정말 중요. 논문 구현 시도해보기1논문 구현 시도해보기2 어떤 논문에는 파라미터 하나도 없는 것도 있다.레이어 구조도만 있고 파라미터가 없는 것은 진짜 구현난이도 보스급. 딥러닝 자격증 취득 후기이것이 바로 딥러닝 자격증!! 문제 유형 Category 1: Basic model Category 2: Model from learning dataset Category 3: Image classificationConvolutional Neural Network with real-world image dataset Category 4: Natural language processing (NLP)NLP Text Classification with real-world text dataset Category 5: Time series, sequences and predictionsSequence Model with real-world numeric dataset 이 시험은 응시자가 TensorFlow 2.x를 통해 모델을 빌드하여 문제를 해결할 수 있는지테스트합니다. 머신러닝(ML) 및 딥러닝의 기본 원칙 TensorFlow 2.x에서 ML 모델 개발하기 심층신경망 및 합성곱 신경망(CNN)을 통한 이미지 인식, 객체 탐지, 텍스트 인식 알고리즘 빌드 컴퓨터가 정보를 ‘보는’ 방식과 플롯 손실 및 정확도 이해할 수 있도록 다른 크기 및 형태의 실제 이미지를 활용하여 합성곱에서 이미지의 경로를 시각화 과적합을 예방하기 위한 확장 및 드롭아웃과 같은 전략 탐색 TensorFlow를 이용하여 자연어 처리 문제를 해결하기 위해 신경망 적용 Google 공식 페이지 발췌 합격 점수 / 규칙 허용된 인터넷 브라우징은 Tensorflow document, 총 100점 만점에 90점 커트라인 난이도는 category 5가 가장 높음 시험 시간 : 5시간 (컴퓨터 딥러닝 훈련시간 포함) 따면 좋은 점 개발자 네트워크에 join 할 수가 있어요~ 자격증 네트워크 참고문서 그럼 20000~!","link":"/2020/11/16/training-pc/"}],"tags":[{"name":"HEXO","slug":"HEXO","link":"/tags/HEXO/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"ML","slug":"ML","link":"/tags/ML/"},{"name":"DL","slug":"DL","link":"/tags/DL/"},{"name":"Music EDA","slug":"Music-EDA","link":"/tags/Music-EDA/"},{"name":"Script","slug":"Script","link":"/tags/Script/"}],"categories":[{"name":"GitPage","slug":"GitPage","link":"/categories/GitPage/"},{"name":"Machine Learning","slug":"Machine-Learning","link":"/categories/Machine-Learning/"},{"name":"ilsang","slug":"ilsang","link":"/categories/ilsang/"},{"name":"Hexo","slug":"GitPage/Hexo","link":"/categories/GitPage/Hexo/"},{"name":"Music","slug":"ilsang/Music","link":"/categories/ilsang/Music/"}]}